snlkuharlocal/src/DataProcessors/ФиксацияТрудозатрат/ФиксацияТрудозатрат.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ФиксацияТрудозатрат</name>
</mdclass:DataProcessor>

snlkuharlocal/src/InformationRegisters/РеквизитыСправочников/РеквизитыСправочников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РеквизитыСправочников</name>
  <resources>
    <name>ЗначениеРеквизита</name>
    <type>
      <types>Boolean</types>
      <types>String</types>
      <types>Date</types>
      <types>Number</types>
      <types>DocumentRef</types>
      <types>EnumRef</types>
      <types>CatalogRef</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Справочник</name>
    <type>
      <types>CatalogRef</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИмяРеквизита</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

snlkuharlocal/src/Enums/Отгружен/Отгружен.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>Отгружен</name>
  <enumValues>
    <name>Отгружен</name>
  </enumValues>
  <enumValues>
    <name>Резерв</name>
  </enumValues>
  <enumValues>
    <name>РезервТранзит</name>
    <comment>Резерв транзит</comment>
  </enumValues>
  <enumValues>
    <name>ОтгруженТранзит</name>
    <comment>Отгружен на транзит</comment>
  </enumValues>
  <enumValues>
    <name>Отменен</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Documents/ЛистПереукладки/ЛистПереукладки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЛистПереукладки</name>
  <basedOn>Document.РасходнаяНакладная</basedOn>
  <registerRecords>InformationRegister.СтатусыКМ_Факт</registerRecords>
  <registerRecords>InformationRegister.СтатусыКМ_Факт_А</registerRecords>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъемДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Штрихкод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипШК</name>
    <type>
      <types>EnumRef.ТипыШтрихКодов</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокОснование</name>
    <type>
      <types>DocumentRef.РасходнаяНакладная</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппыТоваров</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипКороба</name>
    <type>
      <types>CatalogRef.ТипыКоробов</types>
    </type>
  </attributes>
  <attributes>
    <name>ШКСкотча1</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>14</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ШКСкотча2</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>14</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоКоробок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЛистНабора</name>
    <type>
      <types>DocumentRef.ЛистНабора</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрефиксЗаказа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуффиксЗаказа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерЗаказа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ШККонтрагента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЭтикеткаРаспечатана</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НеУчитыватьПриОпределенииКоличестваМест</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КодАгрегации</name>
    <type>
      <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
    </type>
  </attributes>
  <attributes>
    <name>КодАгрегацииОтсканирован</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Сканировщик</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаСканирования</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияСканирования</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>РабочееМесто</name>
    <type>
      <types>CatalogRef.РабочиеМеста</types>
    </type>
  </attributes>
  <attributes>
    <name>РежимСканирования</name>
    <type>
      <types>EnumRef.РежимСканирования</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительныеАгрегации</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НеТребуетсяСканирование</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаданиеНаАгрегацию</name>
    <type>
      <types>DocumentRef.ЗаданиеНаАгрегацию</types>
    </type>
  </attributes>
  <attributes>
    <name>УзелТСД</name>
    <type>
      <types>ExchangePlanRef.СкладТСД</types>
      <types>ExchangePlanRef.МобильныеТСД</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтправленНаТСД</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗагруженИзТСД</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СканировщикФизЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерКоробки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Завершен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтклКонтрольНоменклатуры</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъемКоробов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТребуетПроверки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КолШтВКоробке</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЛСК</name>
    <type>
      <types>DocumentRef.ЛистСборкиКомплектовЧЗ</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Отсканировано</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ШК</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>14</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипШК</name>
      <type>
        <types>EnumRef.ТипыШтрихКодов</types>
      </type>
    </attributes>
    <attributes>
      <name>ШтВКоробе</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Единица</name>
      <type>
        <types>CatalogRef.Единицы</types>
      </type>
    </attributes>
    <attributes>
      <name>Коэффициент</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Объем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>7</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТребуетсяМаркировка</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ЭтоСпайка</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ШтрихкодыУпаковок</name>
    <attributes>
      <name>ШтрихкодУпаковки</name>
      <type>
        <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>6</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерЗаказа</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ШтрихкодБлочка</name>
      <type>
        <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
      </type>
    </attributes>
    <attributes>
      <name>ОшибкаСканирования</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОшибкиСотрудников</name>
    <attributes>
      <name>ВидОшибки</name>
      <type>
        <types>EnumRef.ВидыОшибокСотрудников</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ШтрихкодыКоробокДляАгрегации</name>
    <attributes>
      <name>ИсходныйКодКоробки</name>
      <type>
        <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
      </type>
    </attributes>
    <attributes>
      <name>НовыйКодКоробки</name>
      <type>
        <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СодержимоеБлочка</name>
    <comment>По ЗНА</comment>
    <attributes>
      <name>id_Блочка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Отсканировано</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>БлочкиВсего</name>
    <comment>По ЗНА</comment>
    <attributes>
      <name>id_Блочка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Отсканировано</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ШтрихкодыУпаковокБлочков</name>
    <comment>заранее забронированные по ЗНА</comment>
    <attributes>
      <name>ШтрихкодУпаковки</name>
      <type>
        <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
      </type>
    </attributes>
    <attributes>
      <name>Отсканировано</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Бригада</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

snlkuharlocal/src/DataProcessors/ФиксацияТрудозатрат/ObjectModule.bsl
Перем СписокУзловПолучателей; 
Перем НачПериода;
Перем КонПериода;

Процедура Заполнить(ТекПланНабора)
	//Набор
	запрос=новый запрос;
	запрос.Текст= "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПланНаборатБрэндов.НачалоНабора,
	|	ПланНаборатБрэндов.ОкончаниеНабора,
	|	ПланНаборатБрэндов.НачалоСканировки,
	|	ПланНаборатБрэндов.ОкончаниеСканировки,
	|	ПланНаборатБрэндов.НачалоДопОбработки,
	|	ПланНаборатБрэндов.ОкончаниеДопОбработки,
	|	ПланНаборатБрэндов.НачалоПаллетирования,
	|	ПланНаборатБрэндов.ОкончаниеПаллетирования,
	|	ПланНаборатБрэндов.НачалоТермоусадки,
	|	ПланНаборатБрэндов.ОкончаниеТермоусадки,
	|	ПланНаборатБрэндов.Ссылка,
	|	ПланНаборатБрэндов.ОстановкаНабора,
	|	ПланНаборатБрэндов.ОстановкаСканирования,
	|	ПланНаборатБрэндов.ОстановкаДопОбработки
	|ПОМЕСТИТЬ т1
	|ИЗ
	|	Документ.ПланНабора.тБрэндов КАК ПланНаборатБрэндов
	|ГДЕ
	|	ПланНаборатБрэндов.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	т2.НачалоНабора,
	|	т2.ОкончаниеНабора,
	|	т2.НачалоСканировки,
	|	т2.ОкончаниеСканировки,
	|	т2.НачалоДопОбработки,
	|	т2.ОкончаниеДопОбработки,
	|	т2.НачалоПаллетирования,
	|	т2.ОкончаниеПаллетирования,
	|	т2.НачалоТермоусадки,
	|	т2.ОкончаниеТермоусадки,
	|	т2.Ссылка,
	|	т2.ОстановкаНабора,
	|	т2.ОстановкаСканирования,
	|	т2.ОстановкаДопОбработки
	|ИЗ
	|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		т1.НачалоНабора КАК НачалоНабора,
	|		т1.ОкончаниеНабора КАК ОкончаниеНабора,
	|		&ПустаяДата КАК НачалоСканировки,
	|		&ПустаяДата КАК ОкончаниеСканировки,
	|		&ПустаяДата КАК НачалоДопОбработки,
	|		&ПустаяДата КАК ОкончаниеДопОбработки,
	|		&ПустаяДата КАК НачалоПаллетирования,
	|		&ПустаяДата КАК ОкончаниеПаллетирования,
	|		&ПустаяДата КАК НачалоТермоусадки,
	|		&ПустаяДата КАК ОкончаниеТермоусадки,
	|		т1.Ссылка КАК Ссылка,
	|		т1.ОстановкаНабора КАК ОстановкаНабора,
	|		0 КАК ОстановкаСканирования,
	|		0 КАК ОстановкаДопОбработки
	|	ИЗ
	|		т1 КАК т1
	|	ГДЕ
	|		т1.НачалоНабора <> &ПустаяДата
	|		И т1.ОкончаниеНабора <> &ПустаяДата
	//|		И (РАЗНОСТЬДАТ(т1.НачалоНабора, т1.ОкончаниеНабора, СЕКУНДА) - т1.ОстановкаНабора) / 3600 < 10
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		&ПустаяДата,
	|		&ПустаяДата,
	|		т1.НачалоСканировки,
	|		т1.ОкончаниеСканировки,
	|		&ПустаяДата,
	|		&ПустаяДата,
	|		&ПустаяДата,
	|		&ПустаяДата,
	|		&ПустаяДата,
	|		&ПустаяДата,
	|		т1.Ссылка,
	|		0,
	|		т1.ОстановкаСканирования,
	|		0
	|	ИЗ
	|		т1 КАК т1
	|	ГДЕ
	|		т1.НачалоСканировки <> &ПустаяДата
	|		И т1.ОкончаниеСканировки <> &ПустаяДата
	//|		И (РАЗНОСТЬДАТ(т1.НачалоСканировки, т1.ОкончаниеСканировки, СЕКУНДА) - т1.ОстановкаСканирования) / 3600 < 10
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		&ПустаяДата,
	|		&ПустаяДата,
	|		&ПустаяДата,
	|		&ПустаяДата,
	|		т1.НачалоДопОбработки,
	|		т1.ОкончаниеДопОбработки,
	|		&ПустаяДата,
	|		&ПустаяДата,
	|		&ПустаяДата,
	|		&ПустаяДата,
	|		т1.Ссылка,
	|		0,
	|		0,
	|		т1.ОстановкаДопОбработки
	|	ИЗ
	|		т1 КАК т1
	|	ГДЕ
	|		т1.НачалоДопОбработки <> &ПустаяДата
	|		И т1.ОкончаниеДопОбработки <> &ПустаяДата
	//|		И (РАЗНОСТЬДАТ(т1.НачалоДопОбработки, т1.ОкончаниеДопОбработки, СЕКУНДА) - т1.ОстановкаДопОбработки) / 3600 < 10
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		&ПустаяДата,
	|		&ПустаяДата,
	|		&ПустаяДата,
	|		&ПустаяДата,
	|		&ПустаяДата,
	|		&ПустаяДата,
	|		т1.НачалоПаллетирования,
	|		т1.ОкончаниеПаллетирования,
	|		&ПустаяДата,
	|		&ПустаяДата,
	|		т1.Ссылка,
	|		0,
	|		0,
	|		0
	|	ИЗ
	|		т1 КАК т1
	|	ГДЕ
	|		т1.НачалоПаллетирования <> &ПустаяДата
	|		И т1.ОкончаниеПаллетирования <> &ПустаяДата
	//|		И РАЗНОСТЬДАТ(т1.НачалоПаллетирования, т1.ОкончаниеПаллетирования, СЕКУНДА) / 3600 < 10
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		&ПустаяДата,
	|		&ПустаяДата,
	|		&ПустаяДата,
	|		&ПустаяДата,
	|		&ПустаяДата,
	|		&ПустаяДата,
	|		&ПустаяДата,
	|		&ПустаяДата,
	|		т1.НачалоТермоусадки,
	|		т1.ОкончаниеТермоусадки,
	|		т1.Ссылка,
	|		0,
	|		0,
	|		0
	|	ИЗ
	|		т1 КАК т1
	|	ГДЕ
	|		т1.НачалоТермоусадки <> &ПустаяДата
	//|		И РАЗНОСТЬДАТ(т1.НачалоТермоусадки, т1.ОкончаниеТермоусадки, СЕКУНДА) / 3600 < 10
	|		И т1.ОкончаниеТермоусадки <> &ПустаяДата) КАК т2";		  
	запрос.УстановитьПараметр("Ссылка",ТекПланНабора);		
	запрос.УстановитьПараметр("ПустаяДата",ПустаяДата());
	результат=запрос.Выполнить().Выгрузить();
	///////////////////////////////////////////////////Набор
	ТекТЗ=результат.Скопировать();	
	ТекТЗ.Свернуть("НачалоНабора,ОкончаниеНабора,ОстановкаНабора");
	МассПустаяДата=ТекТЗ.НайтиСтроки(Новый Структура("ОкончаниеНабора",ПустаяДата()));
	для каждого СтрМасс из МассПустаяДата цикл
		ТекТЗ.Удалить(ТекТЗ.Индекс(СтрМасс));
	КонецЦикла;
	МассПустаяДата=ТекТЗ.НайтиСтроки(Новый Структура("НачалоНабора",ПустаяДата()));
	для каждого СтрМасс из МассПустаяДата цикл
		ТекТЗ.Удалить(ТекТЗ.Индекс(СтрМасс));
	КонецЦикла;
	Если ТекТЗ.Количество()=0 тогда
		ВремяНаНабор=0;
		ТрудозатратыНаНабор=0;
	иначе
		НачалоНабора='21000101';
		ОкончаниеНабора=ПустаяДата();
		ТрудозатратыНаНабор=0;
		Для каждого СтрТЗ из ТекТЗ цикл
			НачалоНабора=Мин(НачалоНабора,СтрТЗ.НачалоНабора);
			ОкончаниеНабора=Макс(ОкончаниеНабора,СтрТЗ.ОкончаниеНабора);
			ТрудозатратыНаНабор=ТрудозатратыНаНабор+ СтрТЗ.ОстановкаНабора+(СтрТЗ.ОкончаниеНабора-СтрТЗ.НачалоНабора)	
		КонецЦикла;
		ТрудозатратыНаНабор=ТрудозатратыНаНабор/3600;
		ВремяНаНабор=(ОкончаниеНабора-НачалоНабора)/3600;
	КонецЕсли;
	///////////////////////////////////////////////////Набор	
	
	
	///////////////////////////////////////////////////Сканирование
	ТекТЗ=результат.Скопировать();	
	ТекТЗ.Свернуть("НачалоСканировки,ОкончаниеСканировки,ОстановкаСканирования");
	МассПустаяДата=ТекТЗ.НайтиСтроки(Новый Структура("ОкончаниеСканировки",ПустаяДата()));
	для каждого СтрМасс из МассПустаяДата цикл
		ТекТЗ.Удалить(ТекТЗ.Индекс(СтрМасс));
	КонецЦикла;
	МассПустаяДата=ТекТЗ.НайтиСтроки(Новый Структура("НачалоСканировки",ПустаяДата()));
	для каждого СтрМасс из МассПустаяДата цикл
		ТекТЗ.Удалить(ТекТЗ.Индекс(СтрМасс));
	КонецЦикла;
	Если ТекТЗ.Количество()=0 тогда
		ВремяНаСканировку=0;
		ТрудозатратыНаСканировку=0;
	иначе
		НачалоСканировки='21000101';
		ОкончаниеСканировки=ПустаяДата();
		ТрудозатратыНаСканировку=0;
		Для каждого СтрТЗ из ТекТЗ цикл
			НачалоСканировки=Мин(НачалоСканировки,СтрТЗ.НачалоСканировки);
			ОкончаниеСканировки=Макс(ОкончаниеСканировки,СтрТЗ.ОкончаниеСканировки);
			ТрудозатратыНаСканировку=ТрудозатратыНаСканировку+ СтрТЗ.ОстановкаСканирования+ (СтрТЗ.ОкончаниеСканировки-СтрТЗ.НачалоСканировки);	
		КонецЦикла;
		ТрудозатратыНаСканировку=ТрудозатратыНаСканировку/3600;
		ВремяНаСканировку=(ОкончаниеСканировки-НачалоСканировки)/3600;
	КонецЕсли;
	///////////////////////////////////////////////////Сканирование	
	
	
	///////////////////////////////////////////////////Доп обработка
	ТекТЗ=результат.Скопировать();	
	ТекТЗ.Свернуть("НачалоДопОбработки,ОкончаниеДопОбработки,ОстановкаДопОбработки");
	МассПустаяДата=ТекТЗ.НайтиСтроки(Новый Структура("ОкончаниеДопОбработки",ПустаяДата()));
	для каждого СтрМасс из МассПустаяДата цикл
		ТекТЗ.Удалить(ТекТЗ.Индекс(СтрМасс));
	КонецЦикла;
	МассПустаяДата=ТекТЗ.НайтиСтроки(Новый Структура("НачалоДопОбработки",ПустаяДата()));
	для каждого СтрМасс из МассПустаяДата цикл
		ТекТЗ.Удалить(ТекТЗ.Индекс(СтрМасс));
	КонецЦикла;
	Если ТекТЗ.Количество()=0 тогда
		ВремяНаДопОбработку=0;
		ТрудозатратыНаДопОбработку=0;
	иначе
		НачалоДопОбработки='21000101';
		ОкончаниеДопОбработки=ПустаяДата();
		ТрудозатратыНаДопОбработку=0;
		Для каждого СтрТЗ из ТекТЗ цикл
			НачалоДопОбработки=Мин(НачалоДопОбработки,СтрТЗ.НачалоДопОбработки);
			ОкончаниеДопОбработки=Макс(ОкончаниеДопОбработки,СтрТЗ.ОкончаниеДопОбработки);
			ТрудозатратыНаДопОбработку=ТрудозатратыНаДопОбработку+ СтрТЗ.ОстановкаДопОбработки+  (СтрТЗ.ОкончаниеДопОбработки-СтрТЗ.НачалоДопОбработки);	
		КонецЦикла;
		ТрудозатратыНаДопОбработку=ТрудозатратыНаДопОбработку/3600;
		ВремяНаДопОбработку=(ОкончаниеДопОбработки-НачалоДопОбработки)/3600;
	КонецЕсли;
	///////////////////////////////////////////////////Доп обработка	
	
	///////////////////////////////////////////////////Паллетирование
	ТекТЗ=результат.Скопировать();	
	ТекТЗ.Свернуть("НачалоПаллетирования,ОкончаниеПаллетирования");
	МассПустаяДата=ТекТЗ.НайтиСтроки(Новый Структура("ОкончаниеПаллетирования",ПустаяДата()));
	для каждого СтрМасс из МассПустаяДата цикл
		ТекТЗ.Удалить(ТекТЗ.Индекс(СтрМасс));
	КонецЦикла;
	МассПустаяДата=ТекТЗ.НайтиСтроки(Новый Структура("НачалоПаллетирования",ПустаяДата()));
	для каждого СтрМасс из МассПустаяДата цикл
		ТекТЗ.Удалить(ТекТЗ.Индекс(СтрМасс));
	КонецЦикла;
	Если ТекТЗ.Количество()=0 тогда
		ВремяНаПаллетирование=0;
		ТрудозатратыНаПаллетирование=0;
	иначе
		НачалоПаллетирования='21000101';
		ОкончаниеПаллетирования=ПустаяДата();
		ТрудозатратыНаПаллетирование=0;
		Для каждого СтрТЗ из ТекТЗ цикл
			НачалоПаллетирования=Мин(НачалоПаллетирования,СтрТЗ.НачалоПаллетирования);
			ОкончаниеПаллетирования=Макс(ОкончаниеПаллетирования,СтрТЗ.ОкончаниеПаллетирования);
			ТрудозатратыНаПаллетирование=ТрудозатратыНаПаллетирование+ (СтрТЗ.ОкончаниеПаллетирования-СтрТЗ.НачалоПаллетирования);	
		КонецЦикла;
		ТрудозатратыНаПаллетирование=ТрудозатратыНаПаллетирование/3600;
		ВремяНаПаллетирование=(ОкончаниеПаллетирования-НачалоПаллетирования)/3600;
	КонецЕсли;
	///////////////////////////////////////////////////Паллетирование
	
	
	///////////////////////////////////////////////////Термоусадка
	ТекТЗ=результат.Скопировать();	
	ТекТЗ.Свернуть("НачалоТермоусадки,ОкончаниеТермоусадки");
	МассПустаяДата=ТекТЗ.НайтиСтроки(Новый Структура("ОкончаниеТермоусадки",ПустаяДата()));
	для каждого СтрМасс из МассПустаяДата цикл
		ТекТЗ.Удалить(ТекТЗ.Индекс(СтрМасс));
	КонецЦикла;
	МассПустаяДата=ТекТЗ.НайтиСтроки(Новый Структура("НачалоТермоусадки",ПустаяДата()));
	для каждого СтрМасс из МассПустаяДата цикл
		ТекТЗ.Удалить(ТекТЗ.Индекс(СтрМасс));
	КонецЦикла;
	Если ТекТЗ.Количество()=0 тогда
		ВремяНаТермоусадку=0;
		ТрудозатратыНаТермоусадку=0;
	иначе
		НачалоТермоусадки='21000101';
		ОкончаниеТермоусадки=ПустаяДата();
		ТрудозатратыНаТермоусадку=0;
		Для каждого СтрТЗ из ТекТЗ цикл
			НачалоТермоусадки=Мин(НачалоТермоусадки,СтрТЗ.НачалоТермоусадки);
			ОкончаниеТермоусадки=Макс(ОкончаниеТермоусадки,СтрТЗ.ОкончаниеТермоусадки);
			ТрудозатратыНаТермоусадку=ТрудозатратыНаТермоусадку+ (СтрТЗ.ОкончаниеТермоусадки-СтрТЗ.НачалоТермоусадки);	
		КонецЦикла;
		ТрудозатратыНаТермоусадку=ТрудозатратыНаТермоусадку/3600;
		ВремяНаТермоусадку=(ОкончаниеТермоусадки-НачалоТермоусадки)/3600;
	КонецЕсли;
	///////////////////////////////////////////////////Термоусадка
	НакладнаяОб=ТекПланНабора.Накладная.ПолучитьОбъект();
	НакладнаяОб.ВремяНаНабор=ВремяНаНабор;
	НакладнаяОб.ВремяНаСканирование=ВремяНаСканировку;
	НакладнаяОб.ТрудозатратыНаНабор=ТрудозатратыНаНабор;
	НакладнаяОб.ТрудозатратыНаСканирование=ТрудозатратыНаСканировку;
	
	если НакладнаяОб.ТрудозатратыНаТермоусадку=0 тогда
		НакладнаяОб.ТрудозатратыНаТермоусадку=ТрудозатратыНаТермоусадку;
		НакладнаяОб.ВремяНаТермоусадку=ВремяНаТермоусадку;
	КонецЕсли;
	
	если НакладнаяОб.ТрудозатратыНаДО=0 тогда
		НакладнаяОб.ВремяНаДО=ВремяНаДопОбработку;
		НакладнаяОб.ТрудозатратыНаДО=ТрудозатратыНаДопОбработку;
	КонецЕсли;
	
	если НакладнаяОб.ТрудозатратыНаПаллетирование=0 тогда
		НакладнаяОб.ВремяНаПаллетирование=ВремяНаПаллетирование;
		НакладнаяОб.ТрудозатратыНаПаллетирование= ТрудозатратыНаПаллетирование;
	КонецЕсли;
	
	
	
	
	
	
	НакладнаяОб.ОбменДанными.Загрузка=истина; 	
	НакладнаяОб.Записать();
	ПланыОбмена.УдалитьРегистрациюИзменений(СписокУзловПолучателей,НакладнаяОб.ссылка);
	
	
КонецПроцедуры


Функция ЗаполнитьТЧРасходныхМатериаловВнешняя (Документ) 
	
	
	
	
	если документ.метаданные().имя="Перемещение" тогда
		если документ.склад.родитель=документ.складполучатель.родитель тогда
			возврат Истина;  //Внутрискладские ПРМ, и физические и виртуальные
		КонецЕсли;
	КонецЕсли;
	
	
	если документ.метаданные().имя="РасходнаяНакладная" или (документ.метаданные().имя="Перемещение" и документ.склад.родитель=ПараметрыСеанса.ЭтотУзел.Подразделение.ОсновнойСклад.Родитель) тогда
		ТЗМатериалов=ОбработатьЛистыНабора(Документ);	
		
	иначе
		возврат Истина	
	КонецЕсли;
	
	если ЕстьРеквизитДокумента("КоличествоПаллет",документ.метаданные()) тогда
		КоличествоПаллет=документ.количествоПаллет;
	Иначе
		КоличествоПаллет=0;
	КонецЕсли;
	
	если КоличествоПаллет>0 тогда
		ТЗМатериалов=ОбработатьПаллеты(Документ,ТЗМатериалов);
	КонецЕсли;
	
	ТЗМатериалов=ОбработатьНакладную(Документ,ТЗМатериалов);
	
	
	ТЗМатериалов.Свернуть("Номенклатура","Количество");		
	Документ.РасходныеМатериалы.очистить();
	для каждого СтрТзМатериалов из ТЗМатериалов цикл
		если СтрТзМатериалов.количество=0 тогда Продолжить;КонецЕсли;
		СтрТЧ=Документ.РасходныеМатериалы.добавить();
		ЗаполнитьЗначенияСвойств(СтрТЧ,СтрТзМатериалов);
	КонецЦикла;
	
	
КонецФункции





функция ОбработатьЛистыНабора (Документ)
	ТЗМатериалов=новый ТаблицаЗначений;
	ТЗМатериалов.Колонки.Добавить("Количество");
	ТЗМатериалов.Колонки.Добавить("Номенклатура");
	
	Запрос=новый запрос;
	запрос.Текст= "ВЫБРАТЬ
	              |	док.Ссылка КАК ЛН,
	              |	1 КАК КоличествоКоробок,
	              |	док.ТипКороба КАК ТипКороба
	              |ИЗ
	              |	Документ.ЛистПереукладки КАК док
	              |ГДЕ
	              |	док.Проведен
				  |	И док.ДокОснование = &ДокОснование
				  // Кухарь А.Ю.  11.08.2022 начало
				  // ЛП для хранения номеров заказа FBS
				  |	И не док.НеУчитыватьПриОпределенииКоличестваМест";
				  // Кухарь А.Ю.  11.08.2022 конец
				  
	запрос.УстановитьПараметр("ДокОснование",Документ.ссылка);
	результат=запрос.Выполнить().Выгрузить();
	если результат.Количество()=0 тогда				
		Запрос=новый запрос;
		запрос.Текст= "ВЫБРАТЬ
		|	ЛистНабора.Ссылка как ЛН,
		|	ЛистНабора.КоличествоКоробок как КоличествоКоробок,
		|	ЛистНабора.ТипКороба как ТипКороба
		|ИЗ
		|	Документ.ЛистНабора КАК ЛистНабора
		|ГДЕ
		|	ЛистНабора.Проведен
		|	И ЛистНабора.ДокОснование = &ДокОснование";
		запрос.УстановитьПараметр("ДокОснование",Документ.ссылка);
		результат=запрос.Выполнить().Выгрузить();
		СписокКоробок=результат.ВыгрузитьКолонку("ТипКороба");		
	КонецЕсли;	
	
	
	
	если результат.Количество()>0 тогда	
		СписокНоменклатуры=новый СписокЗначений;
		Для каждого СтрТовары из Документ.товары цикл
			СписокНоменклатуры.Добавить(СтрТовары.номенклатура.родитель);
		КонецЦикла;		
		запрос=новый запрос;
		запрос.Текст="ВЫБРАТЬ
		|	ВидыНормРасходаМатериалов.Ссылка КАК ВидНормыСсылка,
		|	ВидыНормРасходаМатериалов.Наименование КАК ВидНормыНаименование,
		|	ВидыНормРасходаМатериалов.ИмяНормыРасхода КАК ИмяНормыРасхода,
		|	ВидыНормРасходаМатериалов.ЗначениеНормыРасхода КАК ЗначениеНормыРасхода,
		|	ВидыНормРасходаМатериалов.ВладелецНормыРасхода КАК Владелец
		|ИЗ
		|	Справочник.ВидыНормРасходаМатериалов КАК ВидыНормРасходаМатериалов
		|ГДЕ
		|	ВидыНормРасходаМатериалов.ВладелецНормыРасхода В(&СписокНоменклатуры)
		|	И ВидыНормРасходаМатериалов.ПометкаУдаления = ЛОЖЬ
		| Объединить все
		|ВЫБРАТЬ
		|	ВидыНормРасходаМатериалов.Ссылка,
		|	ВидыНормРасходаМатериалов.Наименование,
		|	ВидыНормРасходаМатериалов.ИмяНормыРасхода,
		|	ВидыНормРасходаМатериалов.ЗначениеНормыРасхода,
		|	ВидыНормРасходаМатериалов.ВладелецНормыРасхода 
		|ИЗ
		|	Справочник.ВидыНормРасходаМатериалов КАК ВидыНормРасходаМатериалов
		|ГДЕ
		|	ВидыНормРасходаМатериалов.ВладелецНормыРасхода В(&СписокКоробок)
		|	И ВидыНормРасходаМатериалов.ПометкаУдаления = ЛОЖЬ";
		запрос.УстановитьПараметр("СписокКоробок",СписокКоробок);
		запрос.УстановитьПараметр("СписокНоменклатуры",СписокНоменклатуры);
		СписокНормДляЛН=запрос.Выполнить().Выгрузить();	
	иначе
		Возврат ТЗМатериалов;
	КонецЕсли;				  
	
	
	//Кухарь 15.08.17 начало
	//Оптимизация
	если результат.Количество()=0 тогда
		Возврат ТЗМатериалов;
	иначе
		ТЗСтрокМатрицы=СформироватьСписокСтрокМатрицы(результат.Получить(0).ЛН);
	КонецЕсли;
	//Кухарь 15.08.17 конец
	
	Для каждого СтрРез из результат цикл
		//Кухарь 15.08.17 начало
		//Оптимизация
		//ТЗСтрокМатрицы=СформироватьСписокСтрокМатрицы(СтрРез.лн);
		//Кухарь 15.08.17 конец
		
		//Кухарь 03.07.18 начало
		//Будем фиксировать тару не относящиеся к закупаемой
		ЛН=СтрРез.ЛН;
		если ложь тогда ЛН=Документы.ЛистНабора.ПустаяСсылка();КонецЕсли;
		если СтрРез.ЛН.метаданные().имя="ЛистПереукладки"  тогда
			если не ЛН.ТипКороба.ЗакупаемаяТара тогда
				СтрокаТЗМатериалов=ТЗМатериалов.Добавить();
				СтрокаТЗМатериалов.Номенклатура=Справочники.Номенклатура.НайтиПоКоду("SNL-420874"); //Заводская коробка б\у
				СтрокаТЗМатериалов.количество=1;
			КонецЕсли;
		Иначе
			если ЛН.ТипШК=Перечисления.ТипыШтрихКодов.Коробка тогда
				СтрокаТЗМатериалов=ТЗМатериалов.Добавить();
				СтрокаТЗМатериалов.Номенклатура=Справочники.Номенклатура.НайтиПоКоду("SNL-420873"); //Заводская коробка новая
				СтрокаТЗМатериалов.количество=лн.КоличествоКоробок;					
			Иначе
				если не ЛН.ТипКороба.ЗакупаемаяТара тогда
					СтрокаТЗМатериалов=ТЗМатериалов.Добавить();
					СтрокаТЗМатериалов.Номенклатура=Справочники.Номенклатура.НайтиПоКоду("SNL-420874"); //Заводская коробка б\у
					СтрокаТЗМатериалов.количество=1;
				КонецЕсли;
			КонецЕсли;			
		КонецЕсли;
		//Кухарь 03.07.18 конец
		
		если ТЗСтрокМатрицы=Неопределено тогда Продолжить;КонецЕсли;
		если СтрРез.лн.ТипШК=Перечисления.ТипыШтрихКодов.Коробка тогда
			ТЗНом=СтрРез.ЛН.Товары.Выгрузить();
			ТЗНом.Свернуть("Номенклатура","Количество");
			КоличествоЕдиницПленки=0;		
			ОтборКоробочный=новый Структура;
			ОтборКоробочный.Вставить("НаКаждуюКоробкуОтдельно",истина);
			//Кухарь 24.09.17 начало
			//Раньше ТЗСтрокМатрицы была по текущему ЛН, теперь общая 
			ОтборКоробочный.Вставить("ТипШтрихКода",СтрРез.лн.ТипШК);
			//Кухарь 24.09.17 конец
			МассКоробочных=ТЗСтрокМатрицы.НайтиСтроки(ОтборКоробочный);		
			Для каждого СтрТз из ТЗНом цикл
				если СтрТз.номенклатура.родитель.ШтукВКоробке=0 тогда
					КоличествоКоробокТекНоменклатуры=СтрТз.количество;
				иначе
					КоличествоКоробокТекНоменклатуры=СтрТз.количество/СтрТз.номенклатура.родитель.ШтукВКоробке;
				КонецЕсли;				
				для сч=1 по КоличествоКоробокТекНоменклатуры цикл
					Для каждого СтрМасс из МассКоробочных цикл
						//Кухарь 24.09.17 начало
						//Переклейку обрабатываем отдельно
						если СтрМасс.НаКаждуюШтукуПереклейкиОтдельно=ложь тогда
							//Кухарь 24.09.17 начало
							
							СтрокаТЗМатериалов=ТЗМатериалов.Добавить();
							
							
							
							если СтрМасс.НормаРасхода<>0 тогда 
								СтрокаТЗМатериалов.Количество=СтрМасс.НормаРасхода;
							Иначе
								Отбор=новый Структура;
								Отбор.Вставить("Владелец",СтрТз.номенклатура.родитель);
								Отбор.Вставить("ИмяНормыРасхода",СтрМасс.ИмяНормыРасхода);							
								НормаТекущейНоменклатуры=СписокНормДляЛН.НайтиСтроки(Отбор);
								если НормаТекущейНоменклатуры.Количество()=1 тогда
									СтрокаТЗМатериалов.Количество=НормаТекущейНоменклатуры.Получить(0).ЗначениеНормыРасхода;
								ИначеЕсли НормаТекущейНоменклатуры.Количество()>1 тогда
									СтрокаТЗМатериалов.Количество=НормаТекущейНоменклатуры.Получить(0).ЗначениеНормыРасхода;
									
									#Если клиент тогда
										Сообщить("Обнаружено несколько норм "+СтрМасс.ИмяНормыРасхода+" для номенклатуры "+СтрТз.номенклатура.родитель.наименование );
									#КонецЕсли
								иначе
									СтрокаТЗМатериалов.Количество=0;
									#Если клиент тогда
										Сообщить("Отсутствует "+СтрМасс.ИмяНормыРасхода+" для номенклатуры "+СтрТз.номенклатура.родитель.наименование );
									#КонецЕсли
								КонецЕсли;
								
							КонецЕсли;	
							
							
							СтрокаТЗМатериалов.Номенклатура=СтрМасс.Номенклатура;
							//Кухарь 24.09.17 начало
							//Переклейку обрабатываем отдельно
						иначе
							если СтрМасс.НормаРасхода*СтрРез.ЛН.переклейка.итог("Количество")>0 тогда
								СтрокаТЗМатериалов=ТЗМатериалов.Добавить();
								СтрокаТЗМатериалов.Количество=СтрМасс.НормаРасхода*СтрРез.ЛН.переклейка.итог("Количество");
								СтрокаТЗМатериалов.Номенклатура=СтрМасс.Номенклатура;
							КонецЕсли;
						КонецЕсли;
						//Кухарь 24.09.17 начало
						
					КонецЦикла;
				КонецЦикла;			
			КонецЦикла;	
			// тут фиксируем расход материалов для каждой отдельной коробки из ЛН конец
			
			// тут фиксируем расход материалов которые на ЛН в целиком начало  
			ОтборНаЛН=новый Структура;
			ОтборНаЛН.Вставить("НаКаждуюКоробкуОтдельно",ложь);
			//Кухарь 24.09.17 начало
			//Раньше ТЗСтрокМатрицы была по текущему ЛН, теперь общая 
			ОтборНаЛН.Вставить("ТипШтрихКода",СтрРез.лн.ТипШК);
			//Кухарь 24.09.17 конец
			
			МассНаЛН=ТЗСтрокМатрицы.НайтиСтроки(ОтборНаЛН);
			Для каждого СтрМасс из МассНаЛН цикл
				//Кухарь 24.09.17 начало
				//Переклейку обрабатываем отдельно
				если СтрМасс.НаКаждуюШтукуПереклейкиОтдельно=ложь тогда
					//Кухарь 24.09.17 начало
					
					СтрокаТЗМатериалов=ТЗМатериалов.Добавить();
					
					если СтрМасс.НормаРасхода<>0 тогда 
						СтрокаТЗМатериалов.Количество=СтрМасс.НормаРасхода;
					Иначе
						Отбор=новый Структура;
						Отбор.Вставить("Владелец",СтрТз.номенклатура.родитель);
						Отбор.Вставить("ИмяНормыРасхода",СтрМасс.ИмяНормыРасхода);							
						НормаТекущейНоменклатуры=СписокНормДляЛН.НайтиСтроки(Отбор);
						если НормаТекущейНоменклатуры.Количество()=1 тогда
							СтрокаТЗМатериалов.Количество=НормаТекущейНоменклатуры.Получить(0).ЗначениеНормыРасхода;
						ИначеЕсли НормаТекущейНоменклатуры.Количество()>1 тогда
							СтрокаТЗМатериалов.Количество=НормаТекущейНоменклатуры.Получить(0).ЗначениеНормыРасхода;
							
							#Если клиент тогда
								Сообщить("Обнаружено несколько норм "+СтрМасс.ИмяНормыРасхода+" для номенклатуры "+СтрТз.номенклатура.родитель.наименование );
							#КонецЕсли
						иначе
							СтрокаТЗМатериалов.Количество=0;
							#Если клиент тогда
								Сообщить("Отсутствует "+СтрМасс.ИмяНормыРасхода+" для номенклатуры "+СтрТз.номенклатура.родитель.наименование );
							#КонецЕсли
						КонецЕсли;
						
					КонецЕсли;	
					
					
					СтрокаТЗМатериалов.Номенклатура=СтрМасс.Номенклатура;
					//Кухарь 24.09.17 начало
					//Переклейку обрабатываем отдельно
				иначе
					если СтрМасс.НормаРасхода*СтрРез.ЛН.переклейка.итог("Количество")>0 тогда
						СтрокаТЗМатериалов=ТЗМатериалов.Добавить();
						СтрокаТЗМатериалов.Количество=СтрМасс.НормаРасхода*СтрРез.ЛН.переклейка.итог("Количество");
						СтрокаТЗМатериалов.номенклатура=СтрМасс.Номенклатура;
					КонецЕсли;
				КонецЕсли;
				//Кухарь 24.09.17 начало
				
			КонецЦикла;
			// тут фиксируем расход материалов которые на ЛН в целиком конец
			
			//Коробочные ЛН конец
			
			//ЛН с типом ШК - блочок и штука начало
		иначе
			//Кухарь 24.09.17 начало
			//Раньше ТЗСтрокМатрицы была по текущему ЛН, теперь общая 
			//Для каждого СтрМасс из ТЗСтрокМатрицы цикл
			
			ОтборПоШК=Новый  Структура("ТипШтрихКода",?(СтрРез.лн.ТипШК=Перечисления.ТипыШтрихКодов.ПустаяСсылка(),Перечисления.ТипыШтрихКодов.Штука,СтрРез.лн.ТипШК)); 
			
			МассСтрокаТЗМатрицы=ТЗСтрокМатрицы.найтистроки(ОтборПоШК);
			
			Для каждого СтрМасс из МассСтрокаТЗМатрицы цикл
				//Кухарь 24.09.17 начало
				//Переклейку обрабатываем отдельно
				если СтрМасс.НаКаждуюШтукуПереклейкиОтдельно=ложь тогда
					//Кухарь 24.09.17 начало
					
					//Кухарь 24.09.17 конец
					если СтрМасс.Номенклатура<>Справочники.Номенклатура.ПустаяСсылка() тогда
						СтрокаТЗМатериалов=ТЗМатериалов.Добавить();
						если СтрМасс.НормаРасхода<>0 тогда 
							СтрокаТЗМатериалов.Количество=СтрМасс.НормаРасхода;
						Иначе
							Отбор=новый Структура;
							Отбор.Вставить("Владелец",СтрРез.ЛН.ТипКороба);
							//Кухарь 06.02.19 начало
							//Разделение скотча на широкий и узкий
							//Отбор.Вставить("ИмяНормыРасхода",СтрМасс.ИмяНормыРасхода);
							если СтрМасс.ИмяНормыРасхода="НормаРасходаСкотча" и СтрДлина(СтрРез.лн.ШКСкотча1)>2   тогда
								Цифра=Лев(СтрРез.лн.ШКСкотча1,1);
								если цифра<>"5" тогда
									Отбор.Вставить("ИмяНормыРасхода",СтрМасс.ИмяНормыРасхода);									
								иначе
									Отбор.Вставить("ИмяНормыРасхода","НормаРасходаШирокогоСкотча");
								КонецЕсли;
							иначе	
								Отбор.Вставить("ИмяНормыРасхода",СтрМасс.ИмяНормыРасхода);							
							КонецЕсли;						
							//Кухарь 06.02.19 конец
							
							
							
							НормаТекущейНоменклатуры=СписокНормДляЛН.НайтиСтроки(Отбор);
							если НормаТекущейНоменклатуры.Количество()=1 тогда
								СтрокаТЗМатериалов.Количество=НормаТекущейНоменклатуры.Получить(0).ЗначениеНормыРасхода;
							ИначеЕсли НормаТекущейНоменклатуры.Количество()>1 тогда
								СтрокаТЗМатериалов.Количество=НормаТекущейНоменклатуры.Получить(0).ЗначениеНормыРасхода;
								
								#Если клиент тогда
									Сообщить("Обнаружено несколько норм "+СтрМасс.ИмяНормыРасхода+" для типа короба "+СтрРез.ЛН.ТипКороба.наименование );
								#КонецЕсли
							иначе
								СтрокаТЗМатериалов.Количество=0;
								#Если клиент тогда
									Сообщить("Отсутствует "+СтрМасс.ИмяНормыРасхода+" для типа короба "+СтрРез.ЛН.ТипКороба.наименование );
								#КонецЕсли
							КонецЕсли;
							
						КонецЕсли;
						СтрокаТЗМатериалов.Номенклатура=СтрМасс.Номенклатура;
						
						
					Иначе
						если СтрРез.ЛН.ТипКороба.ЗакупаемаяТара тогда
							СтрокаТЗМатериалов=ТЗМатериалов.Добавить();	
							СтрокаТЗМатериалов.Количество=СтрМасс.НормаРасхода;
							СтрокаТЗМатериалов.номенклатура=СтрРез.ЛН.ТипКороба.Номенклатура;
						КонецЕсли; 
						
					КонецЕсли;	
					
					//Кухарь 24.09.17 начало
					//Переклейку обрабатываем отдельно
				иначе
					если СтрМасс.НормаРасхода*СтрРез.ЛН.переклейка.итог("Количество")>0 тогда
						СтрокаТЗМатериалов=ТЗМатериалов.Добавить();
						СтрокаТЗМатериалов.Количество=СтрМасс.НормаРасхода*СтрРез.ЛН.переклейка.итог("Количество");
						СтрокаТЗМатериалов.Номенклатура=СтрМасс.Номенклатура;
					КонецЕсли;
				КонецЕсли;
				//Кухарь 24.09.17 начало
				
				
			КонецЦикла;
			//ЛН с типом ШК - блочок и штука конец
			
			
			//Листы набора конец
			
			/////////////////////
		КонецЕсли;
		
		
	КонецЦикла;
	//КонецЕсли;
	возврат ТЗМатериалов;
КонецФункции

Функция ОбработатьПаллеты (Документ,ТЗМатериалов);
	
	
	запрос=новый запрос;
	//Кухарь 26.12.17 начало
	//Оптимизация
	
	//запрос.Текст= "ВЫБРАТЬ ПЕРВЫЕ 1
	//|	ПаллетаЛистыНабора.Ссылка как Паллета
	//|ИЗ
	//|	Документ.Паллета.ЛистыНабора КАК ПаллетаЛистыНабора
	//|ГДЕ
	//|	ПаллетаЛистыНабора.Документ = &Документ
	//|	И ПаллетаЛистыНабора.Ссылка.Проведен
	//|	И ПаллетаЛистыНабора.Ссылка.Проведен
	//
	//|	И ПаллетаЛистыНабора.Ссылка.ОкончаниеПаллетирования <> &ПустаяДата";
	//запрос.УстановитьПараметр("Документ",Документ.ссылка);
	//запрос.УстановитьПараметр("ПустаяДата",ПустаяДата());
	//результат=запрос.Выполнить().Выгрузить();
	//ТЗСтрокМатрицы=СформироватьСписокСтрокМатрицы(результат.Получить(0).Паллета,Документ.ссылка);
	ТЗСтрокМатрицы=СформироватьСписокСтрокМатрицы(Документы.Паллета.ПустаяСсылка(),Документ.ссылка);
	
	//Кухарь 26.12.17 конец
	
	если ТЗСтрокМатрицы=Неопределено тогда Возврат ТЗМатериалов;КонецЕсли;
	
	
	Для каждого СтрМасс из ТЗСтрокМатрицы цикл
		
		запрос.Текст="ВЫБРАТЬ
		|	ВидыНормРасходаМатериалов.Ссылка КАК ВидНормыСсылка,
		|	ВидыНормРасходаМатериалов.Наименование КАК ВидНормыНаименование,
		|	ВидыНормРасходаМатериалов.ИмяНормыРасхода КАК ИмяНормыРасхода,
		|	ВидыНормРасходаМатериалов.ЗначениеНормыРасхода КАК ЗначениеНормыРасхода,
		|	ВидыНормРасходаМатериалов.ВладелецНормыРасхода КАК Владелец
		|ИЗ
		|	Справочник.ВидыНормРасходаМатериалов КАК ВидыНормРасходаМатериалов
		|ГДЕ
		|	ВидыНормРасходаМатериалов.ПометкаУдаления = ЛОЖЬ
		|	И ВидыНормРасходаМатериалов.ИмяНормыРасхода = &ИмяНормыРасхода";
		запрос.УстановитьПараметр("ИмяНормыРасхода",СтрМасс.ИмяНормыРасхода);
		НормаТекущейНоменклатуры=запрос.Выполнить().Выгрузить();
		
		
		СтрокаТЗМатериалов=ТЗМатериалов.Добавить();
		СтрокаТЗМатериалов.Номенклатура=СтрМасс.Номенклатура;
		
		
		если СтрМасс.НормаРасхода = 0 тогда
			если НормаТекущейНоменклатуры.Количество()>=1 тогда
				СтрокаТЗМатериалов.Количество=НормаТекущейНоменклатуры.Получить(0).ЗначениеНормыРасхода;
			иначе
				СтрокаТЗМатериалов.Количество=0;
			КонецЕсли;
		иначе 
			СтрокаТЗМатериалов.Количество=СтрМасс.НормаРасхода;
		КонецЕсли;
		
		СтрокаТЗМатериалов.количество=СтрокаТЗМатериалов.количество*документ.количествоПаллет;
		
		если СтрМасс.НесколькоПозиций и Документ.ссылка.метаданные().имя="РасходнаяНакладная" тогда
			Запрос=новый запрос;
			запрос.Текст="ВЫБРАТЬ
			|	РеквизитыСправочников.ЗначениеРеквизита
			|ИЗ
			|	РегистрСведений.РеквизитыСправочников КАК РеквизитыСправочников
			|ГДЕ
			|	РеквизитыСправочников.Справочник = &Справочник
			|	И РеквизитыСправочников.ИмяРеквизита = &ИмяРеквизита";	
			запрос.УстановитьПараметр("Справочник",Документ[СтрМасс.ИсточникДругихПозиций]);
			запрос.УстановитьПараметр("ИмяРеквизита",СтрМасс.РеквизитИсточникаДругихПозиций);
			результат=запрос.Выполнить().Выбрать();
			пока результат.Следующий() цикл
				СтрокаТЗМатериалов.Номенклатура=результат.ЗначениеРеквизита;
			КонецЦикла;
			
			
		КонецЕсли;
		
		
	КонецЦикла;
	
	
	
	возврат ТЗМатериалов;
КонецФункции


Функция ОбработатьНакладную(Документ,ТЗМатериалов)
	ТЗСтрокМатрицы=СформироватьСписокСтрокМатрицы(Документ);
	
	если ТЗСтрокМатрицы=Неопределено тогда Возврат ТЗМатериалов;КонецЕсли;
	
	
	Для каждого СтрМасс из ТЗСтрокМатрицы цикл
		СтрокаТЗМатериалов=ТЗМатериалов.Добавить();
		СтрокаТЗМатериалов.количество=СтрМасс.НормаРасхода;
		СтрокаТЗМатериалов.номенклатура=СтрМасс.Номенклатура;
		если СтрМасс.НаКаждуюШтукуОтдельно тогда
			СтрокаТЗМатериалов.количество=СтрокаТЗМатериалов.количество*документ.количествоДокумента;
		ИначеЕсли СтрМасс.НаКаждуюКоробкуОтдельно тогда
			СтрокаТЗМатериалов.количество=СтрокаТЗМатериалов.количество*документ.количествокоробок;
		ИначеЕсли СтрМасс.НаКаждыйБлочокОтдельно тогда
			КоличествоБлочков=0;
			для каждого СтрТч из документ.товары цикл
				если СтрТч.номенклатура.родитель.ШтукВКоробочке=0 тогда Продолжить;КонецЕсли;
				КоличествоБлочков=КоличествоБлочков+СтрТч.количество/СтрТч.номенклатура.родитель.ШтукВКоробочке;
			КонецЦикла;
			КоличествоБлочков=Окр(КоличествоБлочков,0);
			СтрокаТЗМатериалов.количество=СтрокаТЗМатериалов.количество*КоличествоБлочков;
			
		КонецЕсли;
	КонецЦикла;
	
	
	Возврат ТЗМатериалов;
КонецФункции


Функция СформироватьСписокСтрокМатрицы (Документ,накладная=Неопределено)
	
	
	если накладная=Неопределено тогда
		если Документ.метаданные().имя="ЛистНабора" или Документ.метаданные().имя="ЛистПереукладки" тогда
			ДокументСклада=Документ.ДокОснование;
		ИначеЕсли Документ.метаданные().имя="Паллета"  тогда
			если документ.ЛистыНабора.количество()>0 тогда
				ДокументСклада=документ.ЛистыНабора.получить(0).документ;
			иначе 
				возврат Неопределено;
			КонецЕсли;
			
		иначе
			ДокументСклада=документ.ссылка;
		КонецЕсли;
	иначе
		ДокументСклада=накладная
	КонецЕсли;
	
	
	
	запрос=новый запрос;
	запрос.Текст="ВЫБРАТЬ
	|	МатрицаРасходаМатериаловНормыРасхода.ВидДокумента,
	|	МатрицаРасходаМатериаловНормыРасхода.Номенклатура,
	|	МатрицаРасходаМатериаловНормыРасхода.ВидДопОбработки,
	|	МатрицаРасходаМатериаловНормыРасхода.НормаРасхода,
	|	МатрицаРасходаМатериаловНормыРасхода.ТипШтрихКода,
	|	МатрицаРасходаМатериаловНормыРасхода.НаКаждуюКоробкуОтдельно,
	|	МатрицаРасходаМатериаловНормыРасхода.ИмяНормыРасхода,
	|	МатрицаРасходаМатериаловНормыРасхода.НесколькоПозиций,
	|	МатрицаРасходаМатериаловНормыРасхода.ИсточникДругихПозиций,
	|	МатрицаРасходаМатериаловНормыРасхода.РеквизитИсточникаДругихПозиций,
	|	МатрицаРасходаМатериаловНормыРасхода.НаКаждыйБлочокОтдельно,
	|	МатрицаРасходаМатериаловНормыРасхода.НаКаждуюШтукуОтдельно,
	|	МатрицаРасходаМатериаловНормыРасхода.НаКаждуюШтукуПереклейкиОтдельно
	|ИЗ
	|	Справочник.МатрицаРасходаМатериалов.НормыРасхода КАК МатрицаРасходаМатериаловНормыРасхода
	|ГДЕ
	|	 МатрицаРасходаМатериаловНормыРасхода.ВидДокумента = &ВидДокумента
	    // Кухарь А.Ю.  11.08.2022 начало
		// Отбор по складу не нужен
		  //| И	МатрицаРасходаМатериаловНормыРасхода.Ссылка.Склад В ИЕРАРХИИ(&Склад)
		// Кухарь А.Ю.  11.08.2022 конец
		
	|	И МатрицаРасходаМатериаловНормыРасхода.Ссылка.ПометкаУдаления = ЛОЖЬ";
		// Кухарь А.Ю.  11.08.2022 начало
		// Отбор по складу не нужен
		//	запрос.УстановитьПараметр("Склад",ДокументСклада.Склад.Родитель);	
		 
		// Кухарь А.Ю.  11.08.2022 конец
		

	
	запрос.УстановитьПараметр("ВидДокумента",Документ.Метаданные().Имя);
	
	
	ТЗПереченьРасходниковВрем=запрос.Выполнить().Выгрузить();		
	ТЗПереченьРасходников=ТЗПереченьРасходниковВрем.Скопировать();
	ТЗПереченьРасходников.Очистить();
	
	Для каждого СтрТЗВрем из ТЗПереченьРасходниковВрем цикл
		//Кухарь 24.09.17 начало
		//Лишний отбор
		//если СтрТЗВрем.ТипШтрихКода<>Перечисления.ТипыШтрихКодов.ПустаяСсылка() и СтрТЗВрем.ТипШтрихКода<>Документ.типШК тогда
		//	Продолжить;
		//КонецЕсли;
		//Кухарь 24.09.17 конец		
		если  ДокументСклада.метаданные().имя="РасходнаяНакладная"  тогда
			если СтрТЗВрем.ВидДопОбработки<>Справочники.ВидыДопОбработки.ПустаяСсылка()  и ДокументСклада.ДопОбработка тогда
				если ДокументСклада.допобработки.найти(СтрТЗВрем.ВидДопОбработки) = Неопределено тогда
					Продолжить;
				КонецЕсли;
			ИначеЕсли  СтрТЗВрем.ВидДопОбработки<>Справочники.ВидыДопОбработки.ПустаяСсылка() и не ДокументСклада.ДопОбработка тогда
				Продолжить;
				
			КонецЕсли;
		КонецЕсли;
		
		если СтрТЗВрем.ВидДопОбработки<>Справочники.ВидыДопОбработки.ПустаяСсылка() и ДокументСклада.метаданные().имя="Перемещение"  тогда
			если ДокументСклада.пунктдоставки.ВидыДопОбработок.найти(СтрТЗВрем.ВидДопОбработки) = Неопределено тогда
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		
		
		СтрТЗ=ТЗПереченьРасходников.Добавить();
		ЗаполнитьЗначенияСвойств(СтрТЗ,СтрТЗВрем);		
	КонецЦикла;
	
	если ТЗПереченьРасходников.Количество()>0 тогда
		Возврат ТЗПереченьРасходников;
	иначе
		Возврат Неопределено;
	КонецЕсли;
	
	
КонецФункции

Процедура Сформировать(ТаблицаПараметров = Неопределено) Экспорт
	// Кухарь А.Ю.  04.09.2025 начало
	//НачПериода=Константы.ДатаЗапретаРедактирования.Получить()-31*86400;     
	НачПериода=ТекущаяДата()-9*86400;        
	// Кухарь А.Ю.  04.09.2025 конец
	
	КонПериода=ТекущаяДата();
	
	Выборка=ПланыОбмена.Основной.Выбрать();	
	СписокУзловПолучателей=новый Массив;
	Пока Выборка.Следующий() Цикл
		Если  выборка.ТипУзла=Перечисления.ТипУзлаИБ.УправляющееПодразделение  Тогда	
			СписокУзловПолучателей.Добавить(Выборка.Ссылка);
			Прервать;
		КонецЕсли;
	КонецЦикла;		
	
	////////////////////////////////////////Трудозатраты +++
	запрос=новый запрос;
	запрос.Текст="ВЫБРАТЬ
	|	ПланНабора.Ссылка КАК ПланНабора
	|ИЗ
	|	Документ.ПланНабора КАК ПланНабора
	|ГДЕ
	|	ПланНабора.Дата МЕЖДУ &Дата1 И &Дата2
	|	И ПланНабора.Проведен
	|	И ПланНабора.ДокОснование.Проведен
	|	И ПланНабора.ДокОснование.ЭтоРаскомплектация ЕСТЬ NULL
	|	И ПланНабора.Накладная.ТрудозатратыНаНабор = 0
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПланНабора.Дата";
	запрос.УстановитьПараметр("Дата1",НачПериода);
	запрос.УстановитьПараметр("Дата2",КонецДня(КонПериода));
	результат=запрос.Выполнить().Выбрать();

	Пока результат.Следующий() цикл
		Заполнить(результат.ПланНабора);
	КонецЦикла;
	////////////////////////////////////////Трудозатраты ---		
	
	
	//////////////////Заполним расходники по старой схеме			
	запрос=новый запрос;
	запрос.Текст="ВЫБРАТЬ
	|	Док.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.РасходнаяНакладная.РасходныеМатериалы КАК Док
	|ГДЕ
	|	Док.Ссылка.Дата МЕЖДУ &Дата1 И &Дата2
	|	И Док.Ссылка.Проведен
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Док.Ссылка
	|ИЗ
	|	Документ.Перемещение.РасходныеМатериалы КАК Док
	|ГДЕ
	|	Док.Ссылка.Дата МЕЖДУ &Дата1 И &Дата2
	|	И Док.Ссылка.Проведен";
	запрос.УстановитьПараметр("Дата1",НачПериода);
	запрос.УстановитьПараметр("Дата2",КонецДня(КонПериода));
	
	СписокДок=запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
	запрос=новый запрос;
	запрос.Текст="ВЫБРАТЬ
	|	Док.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.РасходнаяНакладная КАК Док
	|ГДЕ
	|	Док.Дата МЕЖДУ &Дата1 И &Дата2
	|	И Док.Проведен
	|	И Док.Отгружен = &Отгружен
	|	И НЕ Док.Ссылка В (&СписокДок)
	|	И Док.Контрагент = &Контрагент
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Док.Ссылка
	|ИЗ
	|	Документ.Перемещение КАК Док
	|ГДЕ
	|	Док.Дата МЕЖДУ &Дата1 И &Дата2
	|	И Док.Проведен
	|	И НЕ Док.Ссылка В (&СписокДок)
	|	И Док.Контрагент = &Контрагент
	|	И Док.Отгружен = &Отгружен";
	запрос.УстановитьПараметр("Дата1",НачПериода);
	запрос.УстановитьПараметр("Дата2",КонецДня(КонПериода));
	запрос.УстановитьПараметр("Отгружен",Перечисления.Отгружен.Отгружен);
	запрос.УстановитьПараметр("СписокДок",СписокДок);
	//если не ЗначениеЗаполнено(Контрагент) тогда
	запрос.Текст=СтрЗаменить(запрос.Текст,"И Док.Контрагент = &Контрагент","");
	//иначе
	//	запрос.УстановитьПараметр("Контрагент",Контрагент);
	//КонецЕсли;
	
	результат=запрос.Выполнить().выбрать();
	пока результат.Следующий() цикл
		попытка
			ДокОбъект=результат.ссылка.ПолучитьОбъект();
			ЗаполнитьТЧРасходныхМатериаловВнешняя(ДокОбъект);
			ДокОбъект.записать();
			ПланыОбмена.УдалитьРегистрациюИзменений(СписокУзловПолучателей,ДокОбъект.ссылка);
		Исключение
			Продолжить;
		КонецПопытки;
	КонецЦикла;
	
КонецПроцедуры
